[
    {
        "title": "Diablo II: Resurrected",
        "year": "C++, 2019 - 2021",
        "blurb": "A Timeless Classic. Diablo II: Resurrected is a remastered version of the quintessential action RPG Diablo II. Pursue the mysterious Dark Wanderer and fight the denizens of hell as you uncover the fate of the Prime Evils Diablo, Mephisto, and Baal.",
        "focuses": [
            "Authoring core components of the Resurrected engine, including the C++17 job system and Render Graph technology",
            "Ownership of the Translation Layer, the system that translates events and info from the underlying 2D game into the 3D world",
            "Audio engineering, replacing a 20-year-old DirectSound implementation with FMOD and enabling multi-platform support"
        ],
        "img": "/assets/img/portfolio/vv/diablo_cover.jpg",
        "link": "https://diablo2.blizzard.com/"
    },
    {
        "title": "Destiny 2",
        "year": "C++, 2018",
        "blurb": "Destiny 2 is an online shared-world first-person shooter primarily developed by Bungie. As a Junior Software Engineer at Vicarious Visions, I worked on a collaborative, high-caliber team helping Bungie to expand the Destiny franchise.",
        "focuses": [
            "UI engineering, helping to ensure content creators had all the tools they needed to make engaging, intuitive, and gorgeous UI",
            "Assisting making changes to the base game that were required to ship Destiny Guardians, a version of Destiny 2 for the South Korean market"
        ],
        "img": "/assets/img/portfolio/vv/d2_cover.jpg",
        "link": "/portfolio/destiny2.html"
    },
    {
        "title": "re[Mod]",
        "year": "C#, 2017-2018",
        "blurb": "re[Mod], my Senior Capstone project from Champlain College, is a multiplayer on-the-fly weapon-building arena first-person shooter. Modify your weapon on-the-fly to become the strongest player and dominate the arena in this networked, 6-player experience.",
        "focuses": [
            "Implementing gameplay mechanics, systems and networking",
            "Code architecture and documentation",
            "Designing a design and art pipeline compatible with rapid iteration"
        ],
        "img": "/assets/img/portfolio/remod/s2_cover1.jpg",
        "link": "/portfolio/remod.html"
    },    
    {
        "title": "Eos",
        "year": "C#, 2017",
        "blurb": "A semester-long VR project produced in Montreal, QC. In Eos, you create a solar system from scratch, and are able to explore and interact with it from the scale of a sun down to the size of a creature on each planet you create.",
        "focuses": [
            "Overall architecture of the codebase",
            "Implementing about half of the gameplay mechanics and systems",
            "Implementing visual effects with the artists and creating Unity Editor tools for the designers"
        ],
        "img": "/assets/img/portfolio/eos/cover.jpg",
        "link": "/portfolio/eos.html"
    },
    {
        "title": "AI Context Behaviors",
        "year": "C++, 2016",
        "blurb": "Less of a game and more of a tech demo, this downloadable piece is an interactive demonstration of my interpretation of Context Behaviors as described by Andrew Frey. This was part of the AI \"research\" project, where we were able to dive into any topic in game AI, whether we had covered it in class or not, and create a demo. I chose to look deeper into Steering Behaviors and alternatives to Steering, and found this really cool topic that I am looking forward to using in a real game project.",
        "focuses": [],
        "img": "/assets/img/portfolio/contextbhvr/cover.png",
        "link": "/portfolio/contextbhvr.html"
    },    
    {
        "title": "BTV Flight",
        "year": "C#, 2016",
        "blurb": "A joint project between Champlain College's Emergent Media Center and the Burlington International Airport. Developed in Unity with the Xbox Kinect 2.0. This interactive experience is designed to be approachable and inviting to anyone passing through the airport, and is on display as a semi-permanent art installation in the North concourse of BTV.",
        "focuses": [
            "All gameplay and AI programming",
            "Implementing and documenting Unity Editor tools for future teams"
        ],
        "img": "/assets/img/portfolio/btvflight/cover.png",
        "link": "/portfolio/btvflight.html"
    }
    
]