{
    "contactinfo": [{
        "link": "tel:1-413-626-6074",
        "text": "(413) 626-6074"
    }, {
        "link": "mailto:contact@jameskeats.com",
        "text": "contact@jameskeats.com"
    }, {
        "link": "https://www.linkedin.com/in/jamesjkeats",
        "text": "www.linkedin.com/in/jamesjkeats"
    }],
    "workexp": [{
            "title": "Software Engineer",
            "timespan": "Jun 2018 - Present",
            "workplace": "Blizzard Entertainment",
            "location": "Albany, NY USA",
            "description": "Member of the systems expertise group with a focus on performance. Author of core engine components for Diablo II: Resurrected including the C++17 job system and Render Graph. Owner of the Translation Layer which converts info from the underlying 2D game into 3D. Assisted with audio engineering, replacing a 20-year-old DirectSound implementation with FMOD and enabling multi-platform support. Previously Vicarious Visions. Past projects include Destiny 2: Foresaken.",
            "previoustitles": [{
                    "title": "Junior Software Engineer",
                    "start": "Jun 2018",
                    "end": "Mar 2019"
                }, {
                    "title": "Associate Software Engineer",
                    "start": "Apr 2019",
                    "end": "Jul 2020"
                }
            ]
        },{
            "title": "Lead Mobile Programmer",
            "timespan": "Jan 2016 - Dec 2016; Sep 2018 - May 2018",
            "workplace": "Emergent Media Center",
            "location": "Burlington, VT USA",
            "description": "Developed software for the Sandbox Team and the BREAKAWAY Team. Implemented games and interactive media using the Xbox Kinect 2, Oculus Rift, and HTC Vive. Solved tasks related to gameplay and artificial intelligence and mobile optimization. Completed a project for Burlington Airport which is now installed in their North Concourse."
        },{
            "title": "Network Programming Intern",
            "timespan": "May 2017 - Aug 2017",
            "workplace": "Behaviour Interactive",
            "location": "Montreal, QC Canada",
            "description": "Worked as a full-time intern on back-end server development. Created general systems for this server as well as game-specific extensions in a test-driven environment. Participated in code reviews for all team pull requests and actively responded to feedback."
        },{
            "title": "Creative Developer Intern",
            "timespan": "Jan 2017 - Apr 2017",
            "workplace": "Moment Factory",
            "location": "Montreal, QC Canada",
            "description": "Developed gamified experiences for Moment Factory’s Interactif Team. Worked with advanced technology, including a Velodyne LiDAR Puck. Closely interacted with other interns and full-time members of the team to implement engaging and innovative Unity and TouchDesigner projects. Completed tasks involving gameplay and network programming."
        }
    ],
    "edexp": {
        "title": "Game Programming, BS",
        "timespan": "Aug 2014 - May 2018",
        "workplace": "Champlain College",
        "location": "Burlington, VT USA",
        "description": "Completed several solo and team projects, including PC, mobile, and virtual reality games. Studied abroad in Montreal Jan-May 2017. Experience as a gameplay, artificial intelligence, network, and tools programmer. Often worked as repo manager and build master on team projects.",
        "coursework": "Matrices, Vectors, & 3D Math; Graphics Programming I&nbsp;&amp;&nbsp;II; Game Architecture; AI for Games; Networking for Games; Artificial Opponents."
    },
    "tech": [{
            "head": "Languages",
            "val": "C++; C#; C; JavaScript; x86 MASM; Python."
        }, {
            "head": "Software",
            "val": "Visual Studio; Perforce; Git; Clang/LLVM; Jira; TFS; Jenkins."
        }, {
            "head": "Personal",
            "val": "Moderate French proficiency; team leadership; strong public speaker; musician and gamer."
        }
    ],
    "logoimages": [
        "assets/img/resume/vstudio.png",
        "assets/img/resume/cpp.png",
        "assets/img/resume/csharp.png",
        "assets/img/resume/git.png"
    ]
}
