{
    "contactinfo": [{
        "link": "mailto:contact@jameskeats.com?subject=Resume",
        "text": "Phone: by request"
    },{
        "link": "https://www.linkedin.com/in/jamesjkeats",
        "text": "www.linkedin.com/in/jamesjkeats"
    }],
    "abstract": "Creative software engineer focused on low-level systems. Strives to write code that runs fast and is memory-efficient, but is easy for the whole team to use and understand. Enjoys debugging and learning about the next big problem.",
    "workexp": [
        {
            "title": "Senior Systems Programmer",
            "timespan": "Dec 2022 - Present",
            "workplace": "Behaviour Interactive",
            "location": "Montreal, QC Canada",
            "bullets": [
                "Owning the integration of several external technologies on Meet Your Maker including Wwise, AMD FidelityFX Super Resolution, and Sony DualShock for PC Games",
                "Profiling and optimizing memory and performance across Gen 8, Gen 9, and PC",
                "Previously worked as a full-time intern on back-end server development"
            ],
            "previoustitles": [{
                "title": "Systems Programmer",
                "start": "Nov 2021",
                "end": "Nov 2022"
            },{
                "title": "Network Programming Intern",
                "start": "May 2017",
                "end": "Aug 2017"
            }],
            "description": "Worked as a full-time intern on back-end server development. Created general systems for this server as well as game-specific extensions in a test-driven environment. Participated in code reviews for all team pull requests and actively responded to feedback."
        },{
            "title": "Software Engineer",
            "timespan": "Jul 2020 - Oct 2021",
            "workplace": "Blizzard Entertainment",
            "location": "Albany, NY USA",
            "bullets": [
                "Member of the systems expertise group with a focus on performance",
                "Authored core engine components for Diablo II: Resurrected including the C++17 job system, file streamer, and render graph",
                "Owned the \"Translation Layer\" system which remapped events and information from the underlying 2D game into 3D",
                "Location was previously Vicarious Visions, an Activision studio; past projects include Destiny 2: Foresaken and support on Call of Duty: Black Ops 4"
            ],
            "description": "Member of the systems expertise group with a focus on performance. Author of core engine components for Diablo II: Resurrected including the C++17 job system and render graph. Owner of the \"Translation Layer\" which remaps info from the underlying 2D game into 3D. Assisted with audio engineering, replacing a 20-year-old DirectSound implementation with FMOD and enabling multi-platform support. Location was previously Vicarious Visions, an Activision studio. Past projects include Destiny 2: Foresaken.",
            "previoustitles": [{
                    "title": "Associate Software Engineer",
                    "start": "Mar 2019",
                    "end": "Jul 2020"
                },{
                    "title": "Junior Software Engineer",
                    "start": "Jun 2018",
                    "end": "Mar 2019"
                }
            ]
        },{
            "title": "Platform Programming Intern/Co-op",
            "timespan": "Sep 2017 - May 2018",
            "workplace": "Emergent Media Center",
            "location": "Burlington, VT USA",
            "bullets": [
                "Solved gameplay tasks for projects using the Xbox Kinect 2, Oculus Rift, and HTC Vive",
                "Lead the mobile optimization effort for BREAKAWAY, a Unity game targeting low-end Android devices",
                "Assisted on an interactive art project currently installed in Burlington Airport"
            ],
            "description": "Developed software for the Sandbox Team. Solved gameplay and AI tasks for projects using the Xbox Kinect 2, Oculus Rift, and HTC Vive. Lead the mobile optimization effort for BREAKAWAY. Assisted on an interactive art installation project for Burlington Airport which is now in their North Concourse."
        },{
            "title": "Creative Developer Intern",
            "timespan": "Jan 2017 - Apr 2017",
            "workplace": "Moment Factory",
            "location": "Montreal, QC Canada",
            "bullets": [
                "Used advanced technology, including a Velodyne LiDAR Puck, to develop gamified experiences with the Interactif Team",
                "Partnered with other interns and full-time team members to build Unity and TouchDesigner prototypes",
                "Completed tasks involving gameplay and network programming"
            ],
            "description": "Developed gamified experiences for Moment Factory’s Interactif Team. Worked with advanced technology, including a Velodyne LiDAR Puck. Closely interacted with other interns and full-time members of the team to implement engaging and innovative Unity and TouchDesigner projects. Completed tasks involving gameplay and network programming."
        }
    ],
    "edexp": {
        "titlefirst": true,
        "title": "Game Programming, BS",
        "timespan": "Aug 2014 - May 2018",
        "workplace": "Champlain College",
        "location": "Burlington, VT USA",
        "description": "Completed solo and team projects, including PC, mobile, and VR games. Studied abroad in Montreal (Jan-May 2017). Experience as a gameplay, AI, network, and tools programmer.",
        "coursework": "Vectors & 3D Math; Graphics Programming; Game Architecture; AI for Games; Networking for Games; Artificial Opponents.",
        "courses": [
            "Vectors & 3D Math",
            "OpenGL Programming",
            "Game Architecture",
            "AI for Games",
            "Networking for Games",
            "Artificial Opponents",
        ]
    },
    "tech": [{
            "head": "Languages",
            "val": "C++; C#; C; Python; JavaScript."
        }, {
            "head": "Software",
            "val": "Visual Studio; Perforce; Git; Clang/LLVM; Jira."
        }, {
            "head": "Personal",
            "val": "Native English; limited working French; team leadership; strong public speaker; musician and gamer."
        }
    ],
    "logoimages": [
        "assets/img/resume/vstudio.png",
        "assets/img/resume/cpp.png",
        "assets/img/resume/csharp.png",
        "assets/img/resume/git.png"
    ]
}
