{
    "title": "Spring 2017: Production II - Eos",
    "byline": "Semester Project (Montreal) - Team \"Good Vives\"",
    "team": [
        "Tyler Chermely // Game Programmer",
        "James Keats // Game Programmer",
        "Richie Conti // Game Designer",
        "Alex Frey // Game Designer",
        "Megan McAvoy // 3D Artist",
        "Christie McCown // 3D Artist",
        "Alana Slattery // 3D Artist",
        "Max Sanel // Producer"
    ],
    "introp": "Production II was an entire semester spent with one team on one project. Our professor gave us very specific requirements and requests, and the class functioned similar to a small studio working with a client. Eos is the result of that dynamic.",
    "intrapara": "In Eos, you create your own solar system. Starting out as a being larger than a sun, you progress through the stages of creation at your own pace, interacting and customizing every step of the way, until you reach the surface of a planet you formed where you can interact with the creatures that live there, and enjoy the scenery you helped create with foliage you placed by hand.",
    "responsibilities": {
        "title": "The other programmer for Eos, Tyler Chermely, and I worked very closely together on almost all of the systems in the game, though we each had some focuses. My main areas were:",
        "items": [
            "Overall architecture of the codebase",
            "Creating Unity Editor tools for the designers",
            "The stage/phase switching system (controlling the \"zoom\" level)",
            "The asteroid and comet gameplay",
            "The biome type switching system for planet continents",
            "Movement on the surface of the planet",
            "Implementing visual effects (including particle systems) with the artists",
            "Creating a model importer tool to help the artists with folder structuring"
        ]
    },
    "closing": "Working in VR certainly offered unique challenges with debugging. All of us worked hard and spent long hours in the VR lab at the school's Academic Center to create the best product we could. In the end, we created an engaging, fun, and gorgeous experience that earned us the praise of our professor who is notoriously hard to please. Eos was one of the biggest learning experiences I've had at Champlain, and I am very proud of how it came out."
}